import React from "react";
import Header from "../../components/Header";
import "./Home.scss";

import img from "../../assets/img/psychologist.png";
import ServiceItem from "../../components/ServiceItem";

const Home = () => {
  return (
    <div className="home">
      <Header />
      <div className="main">
        <div className="main__left">
          <div className="desc">
            <h1>Эстер Рейзер</h1>
            <p>Мадрихат калот, преподаватель иудаизма и семейный консультант</p>
            <button>Записаться</button>
          </div>
        </div>
        <div className="main__right">
          <div className="date">
            <h1>17</h1>
            <p>августа</p>
            <p className="bold">2022</p>
          </div>
          <img src={img} />
          <p className="desc">
            “Многие годы я веду курсы ортодоксального гиюра «Натив». Более 10
            лет провожу занятия для женихов и невест, семейных пар, а также
            желающих открыть для себя иудаизм”.
          </p>
          <ul>
            <li>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_56_164)">
                  <path
                    d="M24.346 19.3403L20.7028 16.9107C20.2404 16.6048 19.6207 16.7054 19.2789 17.1419L18.2176 18.5064C18.0812 18.6862 17.8333 18.7384 17.636 18.6288L17.4341 18.5175C16.7649 18.1528 15.9323 17.6986 14.2546 16.0204C12.577 14.3421 12.1219 13.5088 11.7572 12.8409L11.6465 12.639C11.5354 12.4417 11.5866 12.1928 11.7665 12.0553L13.13 10.9943C13.5663 10.6525 13.6671 10.0329 13.3616 9.57045L10.932 5.92719C10.6189 5.45623 9.99073 5.31486 9.50603 5.60622L7.98255 6.52138C7.50386 6.8028 7.15267 7.25857 7.00261 7.79318C6.45401 9.79208 6.86672 13.2419 11.9486 18.3243C15.9911 22.3665 19.0005 23.4536 21.069 23.4536C21.5451 23.4556 22.0193 23.3937 22.4788 23.2694C23.0136 23.1195 23.4694 22.7683 23.7506 22.2895L24.6667 20.7669C24.9585 20.2821 24.8172 19.6536 24.346 19.3403ZM24.1498 20.4591L23.2359 21.9826C23.0339 22.3282 22.7061 22.5823 22.321 22.6917C20.4757 23.1983 17.2518 22.7787 12.373 17.8999C7.4942 13.0211 7.0746 9.79749 7.58123 7.95189C7.69076 7.56635 7.94518 7.23807 8.29121 7.03581L9.81469 6.12185C10.025 5.99531 10.2976 6.05665 10.4335 6.26102L11.7533 8.24251L12.8611 9.90396C12.9937 10.1046 12.9501 10.3734 12.7609 10.5219L11.397 11.5828C10.9819 11.9002 10.8634 12.4745 11.1189 12.9302L11.2272 13.127C11.6106 13.8301 12.0872 14.7048 13.8273 16.4445C15.5673 18.1842 16.4417 18.6609 17.1445 19.0442L17.3415 19.1528C17.7972 19.4083 18.3715 19.2898 18.6889 18.8748L19.7499 17.5109C19.8983 17.3217 20.1671 17.2782 20.3678 17.4107L24.0107 19.8403C24.2152 19.9761 24.2766 20.2488 24.1498 20.4591Z"
                    fill="#49362B"
                  />
                  <path
                    d="M17.0177 8.45609C19.8326 8.45922 22.1138 10.7404 22.117 13.5553C22.117 13.721 22.2512 13.8553 22.4169 13.8553C22.5826 13.8553 22.7169 13.721 22.7169 13.5553C22.7134 10.4092 20.1638 7.85965 17.0177 7.8562C16.8521 7.8562 16.7178 7.99048 16.7178 8.15615C16.7178 8.32181 16.8521 8.45609 17.0177 8.45609Z"
                    fill="#49362B"
                  />
                  <path
                    d="M17.0177 10.2558C18.8391 10.258 20.3151 11.734 20.3172 13.5554C20.3172 13.721 20.4516 13.8553 20.6172 13.8553C20.7829 13.8553 20.9171 13.721 20.9171 13.5554C20.9146 11.4028 19.1703 9.65841 17.0177 9.65594C16.8521 9.65594 16.7178 9.79022 16.7178 9.95589C16.7178 10.1216 16.8521 10.2558 17.0177 10.2558Z"
                    fill="#49362B"
                  />
                  <path
                    d="M17.0177 12.0555C17.8456 12.0565 18.5165 12.7274 18.5175 13.5553C18.5175 13.721 18.6518 13.8553 18.8174 13.8553C18.9831 13.8553 19.1174 13.721 19.1174 13.5553C19.1161 12.3963 18.1768 11.457 17.0177 11.4557C16.8521 11.4557 16.7178 11.5899 16.7178 11.7556C16.7178 11.9213 16.8521 12.0555 17.0177 12.0555Z"
                    fill="#49362B"
                  />
                </g>
                <circle
                  cx="15"
                  cy="15"
                  r="14.75"
                  stroke="#49362B"
                  stroke-width="0.5"
                />
                <defs>
                  <clipPath id="clip0_56_164">
                    <rect
                      width="18"
                      height="18"
                      fill="white"
                      transform="translate(6.81836 5.45456)"
                    />
                  </clipPath>
                </defs>
              </svg>
              +972 50 412 1234
            </li>
            <li>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_56_166)">
                  <path
                    d="M23.9184 7.55452H7.71836C7.22132 7.55452 6.81836 7.95745 6.81836 8.45452V20.4545C6.81836 20.9515 7.22129 21.3545 7.71836 21.3545H23.9184C24.4154 21.3545 24.8184 20.9516 24.8184 20.4545V8.45452C24.8184 7.95748 24.4154 7.55452 23.9184 7.55452ZM24.2183 20.4545C24.2183 20.6202 24.0841 20.7545 23.9184 20.7545H7.71836C7.55267 20.7545 7.41837 20.6202 7.41837 20.4545V8.45452C7.41837 8.28883 7.55267 8.15453 7.71836 8.15453H23.9184C24.0841 8.15453 24.2183 8.28883 24.2183 8.45452V20.4545Z"
                    fill="#49362B"
                  />
                  <path
                    d="M23.3447 8.75563C23.2654 8.7487 23.1866 8.77356 23.1257 8.82475L16.2047 14.6387C15.9814 14.8264 15.6557 14.8264 15.4324 14.6387L8.51148 8.82471C8.42939 8.7558 8.31675 8.73591 8.21603 8.77254C8.11531 8.80917 8.04176 8.89678 8.02313 9.00236C8.0045 9.10793 8.04359 9.2154 8.12568 9.28431L15.0467 15.098C15.4927 15.4736 16.1444 15.4736 16.5905 15.098L23.5115 9.28435C23.5724 9.23319 23.6105 9.15993 23.6175 9.08065C23.6244 9.00137 23.5995 8.92259 23.5483 8.86166C23.4972 8.80066 23.424 8.76256 23.3447 8.75563Z"
                    fill="#49362B"
                  />
                  <path
                    d="M12.5883 15.0568C12.4821 15.0331 12.3715 15.0687 12.299 15.1499L8.09903 19.6499C8.02302 19.7278 7.99511 19.8407 8.02612 19.945C8.05712 20.0493 8.14217 20.1286 8.24834 20.1523C8.35454 20.176 8.46522 20.1403 8.53764 20.0591L12.7377 15.5591C12.8137 15.4813 12.8416 15.3683 12.8106 15.2641C12.7796 15.1598 12.6945 15.0805 12.5883 15.0568Z"
                    fill="#49362B"
                  />
                  <path
                    d="M19.3374 15.1499C19.2651 15.0687 19.1543 15.0331 19.0481 15.0568C18.9419 15.0805 18.8569 15.1598 18.8259 15.2641C18.7949 15.3684 18.8228 15.4813 18.8988 15.5591L23.0988 20.0591C23.2128 20.1758 23.3989 20.1801 23.5182 20.0689C23.6374 19.9576 23.6459 19.7716 23.5375 19.6499L19.3374 15.1499Z"
                    fill="#49362B"
                  />
                </g>
                <circle
                  cx="15"
                  cy="15"
                  r="14.75"
                  stroke="#49362B"
                  stroke-width="0.5"
                />
                <defs>
                  <clipPath id="clip0_56_166">
                    <rect
                      width="18"
                      height="18"
                      fill="white"
                      transform="translate(6.81836 5.45453)"
                    />
                  </clipPath>
                </defs>
              </svg>
              pochta@mail.ru
            </li>
            <li>
              <svg
                width="30"
                height="30"
                viewBox="0 0 30 30"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M16.4284 5.54544C15.1216 5.54544 14.0842 5.88337 13.3834 6.58672C12.7445 7.2279 12.4343 8.11021 12.4381 9.18197L12.4382 11.3168H10.9733C10.812 11.3168 10.6816 11.4476 10.6816 11.6085V14.5411C10.6816 14.7023 10.8125 14.8327 10.9733 14.8327H12.4382V23.2538C12.4382 23.415 12.5691 23.5454 12.7299 23.5454H16.3395C16.5007 23.5454 16.6309 23.4144 16.6312 23.2538V14.8328H18.7609C18.9039 14.8328 19.0262 14.7291 19.0489 14.5873L19.3885 11.6185C19.3943 11.538 19.3669 11.4586 19.3115 11.3991C19.2559 11.3391 19.1781 11.3058 19.0976 11.3058H19.0822H16.6444V9.59244C16.6444 9.55641 16.6754 9.47357 16.7593 9.38218C16.7719 9.36843 16.7857 9.35448 16.8008 9.34048C16.9109 9.23824 17.0376 9.18155 17.1351 9.18155H19.1011C19.2624 9.18155 19.3928 9.05071 19.3928 8.88987V5.83712C19.3928 5.67584 19.2619 5.54544 19.1011 5.54544H16.4284ZM13.0216 22.9621H16.0479V14.5411C16.0479 14.3802 16.1783 14.2494 16.3395 14.2494H16.4014H18.5101C18.5724 13.8249 18.6989 12.9025 18.7826 11.8891H16.3528C16.192 11.8891 16.0611 11.7587 16.0611 11.5974V9.59244C16.0611 9.38329 16.1675 9.17512 16.3102 9.01035C16.3371 8.97928 16.3654 8.94975 16.3944 8.92205C16.5814 8.74361 16.8466 8.59819 17.1352 8.59819H18.8095V6.1288H16.4285C15.2578 6.1288 14.3981 6.42073 13.8352 6.96081C13.8222 6.97323 13.8094 6.98578 13.7968 6.99846C13.7351 7.06035 13.677 7.12537 13.6224 7.19352C13.226 7.68864 13.0186 8.34928 13.0216 9.17996L13.0217 9.21057L13.0217 11.6085C13.0217 11.7693 12.8913 11.9002 12.73 11.9002H11.265V14.2494H12.7299C12.8908 14.2494 13.0216 14.3798 13.0216 14.5411V22.9621Z"
                  fill="#49362B"
                />
                <circle
                  cx="15"
                  cy="15"
                  r="14.75"
                  stroke="#49362B"
                  stroke-width="0.5"
                />
              </svg>
              facebook.com/1628
            </li>
          </ul>
        </div>
      </div>
      <div className="about">
        <div className="about__left">
          <h1>Обо мне</h1>
        </div>
        <div className="about__right">
          <p>
            Я сделала алию в 15 лет будучи обычным советским подростком из
            ассимилированной еврейской семьи. Мне посчастливилось познакомиться
            с соблюдающими еврейскими семьями, побывать на Шабатах и наблюдать
            жизнь еврейской семьи вблизи. Тогда я поняла, что это та семья,
            которую я бы хотела создать - семья с принципами взаимоотношений,
            основанными на взаимоуважении, любви, поддержке и общей цели. Так я
            открыла для себя новую систему координат, центром которой являются
            семейные узы. Постепенно я набиралась семейного опыта, училась
            договариваться, выстраивать отношения с близкими на основе доверия и
            любви. И чем больше знаний и опыта я получала, тем больше я
            чувствовала потребность в их передаче другим людям.
            <br />
            <br />
            Искренне убеждена, что семья – это основа основ, жизненный фундамент
            и краеугольный камень существования любого человека.
            <br />
            <br />Я стараюсь объединить полученный мною опыт, галахические
            принципы и основы психологии для оказания помощи семейным парам на
            пути к их личному счастью. На протяжении последних 10 лет еврейские
            девушки, религиозные и светские пары приходят ко мне за поддержкой и
            галахическими консультациями. Вместе мы учимся разбираться в самых
            деликатных и важных темах.
          </p>
        </div>
      </div>
      <div className="services">
        <h1 className="services__title">Чем я могу Вам помочь</h1>
        <div className="services__items">
          <ServiceItem />
          <ServiceItem />
          <ServiceItem />
        </div>
      </div>
    </div>
  );
};

export default Home;
