import wedding from "./img/wedding.png";
import family from "./img/family.png";
import lessons from "./img/lessons.png";

export const services = [
  {
    id: 0,
    title: "Частные семейные консультации",
    text: `Наверное, мы не подходим друг другу. Знакомая мысль? Действительно, все люди разные. Эта прописная истина обычно воспринимается как данность и не вызывает тревоги. Однако, как только замечаешь принципиальные отличия своих принципов и суждений от установок супруга, внутренний покой и радость общения сразу куда-то исчезают. Возникает тревога за совместное будущее.
        Семейные консультации направлены на выяснение и преодоление причин возникших противоречий и позволяют сохранить семью и здоровые взаимоотношения. Супруги, работающие со мной, учатся чувствовать переживания друг друга и находить ключ к взаимопониманию.
        Семейное счастье – не свод четко прописанных обязанностей. Поэтому задача консультанта – не критиковать и искать виновных, а давать инструменты, помогающие справляться с разногласиями и преодолевать конфликты. Вовремя разглядеть, что беспокоит партнера, и находить правильные слова и решения.
        Семейный консультант учит искать компромисс, понимать и уважать личные границы.  
        На занятиях мы обращаемся одновременно к галахическим и психологическим основам жизни еврейской семьи. Стараемся развивать сильные качества и зоны роста каждого в паре.
        `,
    img: family,
  },
  {
    id: 1,
    title: "Уроки иудаизма",
    text: `Любое знание приносит максимальную пользу только тогда, когда является частью системы. Недостаточно отыскать информацию в книгах или в Интернете. Необходимо овладеть комплексом системных знаний, которые позволяют ответить на волнующие вас вопросы и помогают справиться с жизненными неурядицами.
    Именно по этому принципу строятся наши занятия иудаизма для взрослых и детей. Моя авторская методика основана на изучении ТаНаХа, Галахи и еврейской философии. На занятиях мы сравниваем разные подходы, анализируем, делаем выводы.
    Как проходят уроки? Первый этап – беседа, в ходе которой выясняется, с чем слушатель уже знаком и что хочет получить в процессе обучения. На основе этого составляется индивидуальный план лекций. Каждая программа уникальна в своем роде и создается специально для каждого слушателя.
    Моя задача – не навязать истины, а объяснить и поддержать в течение всего процесса обучения. В результате слушатель приобретает новое мировоззрение, способное изменить его жизнь и привести его к реальной осознанности своего пути и человеческому счастью.
    `,
    img: lessons,
  },
  {
    id: 2,
    title: "Хадрахат калот",
    text: `Семейная жизнь, как любая долгая дорога, требует подготовки. Для этого и нужны предсвадебные консультации – важный этап на пути к крепкому браку. Таким образом закладывается основа прочных отношений.
    В основе курса перед созданием семьи - практические рекомендации, способствующие укреплению взаимоотношений будущих супругов. Мои слушатели учатся преодолевать жизненные трудности, а также предотвращать возникновение многих жизненных ошибок.
    `,
    img: wedding,
  },
];

export const reviews = [
  {
    id: 0,
    author: "Иван Иванов",
    date: "18 августа 2022",
    text: `Помогли разобраться в себе, рекомендую.`,
  },
  {
    id: 1,
    author: "Андрей Андреев",
    date: "18 августа 2022",
    text: `Отговорили от суицида =) Спасибо !`,
  },
  {
    id: 2,
    author: "Тест Проверков",
    date: "19 августа 2022",
    text: `Адекватная цена, приятная беседа, спасибо Эстер!`,
  },
  {
    id: 3,
    author: "Олег Газманов",
    date: "19 августа 2022",
    text: `ИУДАИЗМ ПОМОГ МНЕ ОБРЕСТИ ПОКОЙ ! СПАСИБО !!!`,
  },
  {
    id: 4,
    author: "Аделия Махмедутова",
    date: "19 августа 2022",
    text: `Думала психолог поможет вернуть мужа в семью . не помогло . только зря деньги отдавала`,
  },
  {
    id: 5,
    author: "Inkvizitor64",
    date: "19 августа 2022",
    text: `после регулярных бесед принял себя, спасибо вам)`,
  },
  {
    id: 6,
    author: "Шишел Мышелов",
    date: "19 августа 2022",
    text: `Психолог шарлатан!! Вот нормальный психолог который помог мне - www.pornhub.com !`,
  },
];
